pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_BE_SUMCTRL_Bits.USEANT */
#define IFX_SPU_BE_SUMCTRL_USEANT_LEN (8u)

/** \brief Mask for Ifx_SPU_BE_SUMCTRL_Bits.USEANT */
#define IFX_SPU_BE_SUMCTRL_USEANT_MSK (0xffu)

/** \brief Offset for Ifx_SPU_BE_SUMCTRL_Bits.USEANT */
#define IFX_SPU_BE_SUMCTRL_USEANT_OFF (23u)

/** \brief Length for Ifx_SPU_BE_PWRSUM_Bits.BASE */
#define IFX_SPU_BE_PWRSUM_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_PWRSUM_Bits.BASE */
#define IFX_SPU_BE_PWRSUM_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_PWRSUM_Bits.BASE */
#define IFX_SPU_BE_PWRSUM_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_PWRSUM_Bits.SCALE */
#define IFX_SPU_BE_PWRSUM_SCALE_LEN (2u)

/** \brief Mask for Ifx_SPU_BE_PWRSUM_Bits.SCALE */
#define IFX_SPU_BE_PWRSUM_SCALE_MSK (0x3u)

/** \brief Offset for Ifx_SPU_BE_PWRSUM_Bits.SCALE */
#define IFX_SPU_BE_PWRSUM_SCALE_OFF (19u)

/** \brief Length for Ifx_SPU_BE_PWRSUM_Bits.PRECISION */
#define IFX_SPU_BE_PWRSUM_PRECISION_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_PWRSUM_Bits.PRECISION */
#define IFX_SPU_BE_PWRSUM_PRECISION_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_PWRSUM_Bits.PRECISION */
#define IFX_SPU_BE_PWRSUM_PRECISION_OFF (21u)

/** \brief Length for Ifx_SPU_BE_PWRCTRL_Bits.BASE */
#define IFX_SPU_BE_PWRCTRL_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_PWRCTRL_Bits.BASE */
#define IFX_SPU_BE_PWRCTRL_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_PWRCTRL_Bits.BASE */
#define IFX_SPU_BE_PWRCTRL_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_PWRCTRL_Bits.EN */
#define IFX_SPU_BE_PWRCTRL_EN_OFF (31u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.BASE */
#define IFX_SPU_BE_CFARCTRL_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_LEN (6u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.SEWIN */
#define IFX_SPU_BE_CFARCTRL_SEWIN_OFF (19u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_LEN (2u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_MSK (0x3u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.EXTNSN */
#define IFX_SPU_BE_CFARCTRL_EXTNSN_OFF (25u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_CAE */
#define IFX_SPU_BE_CFARCTRL_CFAR_CAE_OFF (27u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAR_GOSE */
#define IFX_SPU_BE_CFARCTRL_CFAR_GOSE_OFF (28u)

/** \brief Length for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_LEN (3u)

/** \brief Mask for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_MSK (0x7u)

/** \brief Offset for Ifx_SPU_BE_CFARCTRL_Bits.CFAREN */
#define IFX_SPU_BE_CFARCTRL_CFAREN_OFF (29u)

/** \brief Length for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_LEN (19u)

/** \brief Mask for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_MSK (0x7ffffu)

/** \brief Offset for Ifx_SPU_BE_SBCTRL_Bits.BASE */
#define IFX_SPU_BE_SBCTRL_BASE_OFF (0u)

/** \brief Length for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_LEN (1u)

/** \brief Mask for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BE_SBCTRL_Bits.EN */
#define IFX_SPU_BE_SBCTRL_EN_OFF (31u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R0 */
#define IFX_SPU_BIN_REJ_B_R0_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R0 */
#define IFX_SPU_BIN_REJ_B_R0_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R0 */
#define IFX_SPU_BIN_REJ_B_R0_OFF (0u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R1 */
#define IFX_SPU_BIN_REJ_B_R1_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R1 */
#define IFX_SPU_BIN_REJ_B_R1_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R1 */
#define IFX_SPU_BIN_REJ_B_R1_OFF (1u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R2 */
#define IFX_SPU_BIN_REJ_B_R2_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R2 */
#define IFX_SPU_BIN_REJ_B_R2_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R2 */
#define IFX_SPU_BIN_REJ_B_R2_OFF (2u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R3 */
#define IFX_SPU_BIN_REJ_B_R3_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R3 */
#define IFX_SPU_BIN_REJ_B_R3_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R3 */
#define IFX_SPU_BIN_REJ_B_R3_OFF (3u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R4 */
#define IFX_SPU_BIN_REJ_B_R4_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R4 */
#define IFX_SPU_BIN_REJ_B_R4_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R4 */
#define IFX_SPU_BIN_REJ_B_R4_OFF (4u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R5 */
#define IFX_SPU_BIN_REJ_B_R5_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R5 */
#define IFX_SPU_BIN_REJ_B_R5_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R5 */
#define IFX_SPU_BIN_REJ_B_R5_OFF (5u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R6 */
#define IFX_SPU_BIN_REJ_B_R6_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R6 */
#define IFX_SPU_BIN_REJ_B_R6_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R6 */
#define IFX_SPU_BIN_REJ_B_R6_OFF (6u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R7 */
#define IFX_SPU_BIN_REJ_B_R7_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R7 */
#define IFX_SPU_BIN_REJ_B_R7_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R7 */
#define IFX_SPU_BIN_REJ_B_R7_OFF (7u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R8 */
#define IFX_SPU_BIN_REJ_B_R8_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R8 */
#define IFX_SPU_BIN_REJ_B_R8_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R8 */
#define IFX_SPU_BIN_REJ_B_R8_OFF (8u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R9 */
#define IFX_SPU_BIN_REJ_B_R9_LEN (1u)

/** \brief Mask for Ifx_SPU_BIN_REJ_Bits.B_R9 */
#define IFX_SPU_BIN_REJ_B_R9_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BIN_REJ_Bits.B_R9 */
#define IFX_SPU_BIN_REJ_B_R9_OFF (9u)

/** \brief Length for Ifx_SPU_BIN_REJ_Bits.B_R10 */
#define IFX_SPU_BIN_REJ_B_R10_LEN (1u)

