pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_LEN (16u)

/** \brief Mask for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_MAGAPPROX_Bits.ALPHA */
#define IFX_SPU_MAGAPPROX_ALPHA_OFF (0u)

/** \brief Length for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_LEN (16u)

/** \brief Mask for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_MAGAPPROX_Bits.BETA */
#define IFX_SPU_MAGAPPROX_BETA_OFF (16u)

/** \brief Length for Ifx_SPU_NCI_SCALAR0_Bits.ANT0 */
#define IFX_SPU_NCI_SCALAR0_ANT0_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR0_Bits.ANT0 */
#define IFX_SPU_NCI_SCALAR0_ANT0_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR0_Bits.ANT0 */
#define IFX_SPU_NCI_SCALAR0_ANT0_OFF (0u)

/** \brief Length for Ifx_SPU_NCI_SCALAR0_Bits.ANT1 */
#define IFX_SPU_NCI_SCALAR0_ANT1_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR0_Bits.ANT1 */
#define IFX_SPU_NCI_SCALAR0_ANT1_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR0_Bits.ANT1 */
#define IFX_SPU_NCI_SCALAR0_ANT1_OFF (16u)

/** \brief Length for Ifx_SPU_NCI_SCALAR1_Bits.ANT2 */
#define IFX_SPU_NCI_SCALAR1_ANT2_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR1_Bits.ANT2 */
#define IFX_SPU_NCI_SCALAR1_ANT2_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR1_Bits.ANT2 */
#define IFX_SPU_NCI_SCALAR1_ANT2_OFF (0u)

/** \brief Length for Ifx_SPU_NCI_SCALAR1_Bits.ANT3 */
#define IFX_SPU_NCI_SCALAR1_ANT3_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR1_Bits.ANT3 */
#define IFX_SPU_NCI_SCALAR1_ANT3_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR1_Bits.ANT3 */
#define IFX_SPU_NCI_SCALAR1_ANT3_OFF (16u)

/** \brief Length for Ifx_SPU_NCI_SCALAR2_Bits.ANT4 */
#define IFX_SPU_NCI_SCALAR2_ANT4_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR2_Bits.ANT4 */
#define IFX_SPU_NCI_SCALAR2_ANT4_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR2_Bits.ANT4 */
#define IFX_SPU_NCI_SCALAR2_ANT4_OFF (0u)

/** \brief Length for Ifx_SPU_NCI_SCALAR2_Bits.ANT5 */
#define IFX_SPU_NCI_SCALAR2_ANT5_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR2_Bits.ANT5 */
#define IFX_SPU_NCI_SCALAR2_ANT5_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR2_Bits.ANT5 */
#define IFX_SPU_NCI_SCALAR2_ANT5_OFF (16u)

/** \brief Length for Ifx_SPU_NCI_SCALAR3_Bits.ANT6 */
#define IFX_SPU_NCI_SCALAR3_ANT6_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR3_Bits.ANT6 */
#define IFX_SPU_NCI_SCALAR3_ANT6_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR3_Bits.ANT6 */
#define IFX_SPU_NCI_SCALAR3_ANT6_OFF (0u)

/** \brief Length for Ifx_SPU_NCI_SCALAR3_Bits.ANT7 */
#define IFX_SPU_NCI_SCALAR3_ANT7_LEN (16u)

/** \brief Mask for Ifx_SPU_NCI_SCALAR3_Bits.ANT7 */
#define IFX_SPU_NCI_SCALAR3_ANT7_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_NCI_SCALAR3_Bits.ANT7 */
#define IFX_SPU_NCI_SCALAR3_ANT7_OFF (16u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CAALGO */
#define IFX_SPU_CFAR_CFG1_CAALGO_LEN (2u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CAALGO */
#define IFX_SPU_CFAR_CFG1_CAALGO_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CAALGO */
#define IFX_SPU_CFAR_CFG1_CAALGO_OFF (0u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.GOSALGO */
#define IFX_SPU_CFAR_CFG1_GOSALGO_LEN (2u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.GOSALGO */
#define IFX_SPU_CFAR_CFG1_GOSALGO_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.GOSALGO */
#define IFX_SPU_CFAR_CFG1_GOSALGO_OFF (2u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_OFF (4u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_LEN (3u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_OFF (10u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_LEN (2u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_OFF (14u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_OFF (16u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_OFF (0u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_LEN (5u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_OFF (6u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_LEN (5u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_OFF (11u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_OFF (16u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_LEN (3u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_OFF (22u)

/** \brief Length for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_OFF (0u)

/** \brief Length for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_OFF (16u)

/** \brief Length for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_LEN (32u)

/** \brief Mask for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_OFF (0u)

/** \brief Length for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_LEN (32u)

/** \brief Mask for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_OFF (0u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_LEN (2u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_MSK (0x3u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_OFF (0u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_LEN (1u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_OFF (2u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_LEN (1u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_OFF (3u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_LEN (24u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_MSK (0xffffffu)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_OFF (4u)

